blog-posts/2005-09-08-personalized-personal-information-management-systems.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Personalized personal information management systems</title>
<!-- 2015-10-19 Mon 14:08 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link href='http://fonts.googleapis.com/css?family=Open+Sans' rel='stylesheet' type='text/css'></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">Personalized personal information management systems</h1>
<p>
September 8th, 2005 -
<a href="http://sachachua.com/blog/p/2964"><a href="http://sachachua.com/blog/p/2964">http://sachachua.com/blog/p/2964</a></a>
</p>

<p>
<a href="http://dmarti.spikesource.com/genetically_engineered_cash_cow.htm">Don
Marti quotes an e-mail from Microsoft CEO Steve Ballmer</a>:
</p>

<blockquote>
<p>
The productivity software we have today is designed for
 everyone, but it doesn't really map to the specific kinds of jobs
 people have.
</p>
</blockquote>

<p>
Sophisticated, feature-packed personal information managers are out
 there, but most people use a fraction of the functionality, or even
 throw their hands up in despair and stick with e-mail as their
 task-manager and calendar all in one. We're moving towards
 simplification. <a href="http://www.37signals.com">37signals.com</a>‘s big win
 is that they make web-based task managers that are simple enough to do
 just what people want and not more.
</p>

<p>
I think that the biggest win in terms of personal information
 management comes when we customize software to the kind of data people
 work with&#x2014;and more importantly, the \<sub>way\</sub>_ they work with that data.
 The ultracustomizable
 <a href="http://www.emacswiki.org/cgi-bin/wiki/PlannerMode">Planner</a> showed
 me that even something as small as task sort order could be incredibly
 individualized. For example, today I tried sorting my tasks by role
 and then by my usual stuff. Other times I've sorted it by combinations
 of categories. Other people have written code to sort it by importance
 and urgency, following Dr. Stephen Covey's suggestions, and yet others
 sort by more sophisticated rules. All of that from something that
 traditional PIMs would limit to predefined table headings like “Due
 date” or “Category”!
</p>

<p>
How would this kind of tailoring scale? Boxed software products aim to
 satisfy the majority and make their profits on economies of scale.
 Customized software takes advantage of the economies of niches, of the
 <a href="http://longtail.typepad.com/the_long_tail/">long tail</a> effect of the
Web.
</p>

<p>
When it comes to Planner, I don't mind spending time writing code for
 just one person. Chances are, other people will find that code useful
 too. Besides, most tweaks are created and shared by the community, and
 that's ubercool. I learn \<sub>so\</sub>_ much from them, and I'm grateful for
the
 opportunity to help tailor Planner to become \<sub>their\</sub>_ personal
 information manager.
</p>

<p>
Looking at all the Web 2.0 stuff coming out, I think that kind of
 customization is going to be even more important. User-centered design
 is front and center. Users take an active role in shaping the features
 of an application. Software is turning into a conversation.
</p>

<p>
That's cool.
</p>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
